#pragma warning(disable:4996)
#include"AdjMatGraph.h"

int main() {
	AdjMatGraph g;
	g.reset();
	//1호선
	g.insertVertex("신창");
	g.p("온양온천", 11);
	g.p("배방", 11);
	g.p("아산", 11);
	g.p("쌍용", 11);
	g.p("봉명", 11);
	g.p("천안", 11);
	g.p("두정", 11);
	g.p("직산", 11);
	g.p("성환", 11);
	g.p("평택", 11);
	g.p("지제", 11);
	g.p("서정리", 11);
	g.p("송탄", 11);
	g.p("진위", 11);
	g.p("오산", 11);
	g.p("오산대", 11);
	g.p("세마", 11);
	g.p("병점", 11);
	g.change("병점", "서동탄", 11);
	g.change("병점", "세류", 11);
	g.p("수원", 11);
	g.p("화서", 11);
	g.p("성균관대", 11);
	g.p("의왕", 11);
	g.p("당정", 11);
	g.p("군포", 11);
	g.p("금정", 11);
	g.p("명학", 11);
	g.p("안양", 11);
	g.p("관악", 11);
	g.p("석수", 11);
	g.p("금천구청", 11);
	g.change("금천구청", "광명", 11);
	g.change("금청구청", "독산", 11);
	g.p("가산디지털단지", 11);
	g.p("구로", 11);
	g.insertVertex("인천");
	g.p("동인천", 11);
	g.p("도원", 11);
	g.p("제물포", 11);
	g.p("도화", 11);
	g.p("주안", 11);
	g.p("간석", 11);
	g.p("동암", 11);
	g.p("백운", 11);
	g.p("부평", 11);
	g.p("부개", 11);
	g.p("송내", 11);
	g.p("중동", 11);
	g.p("부천", 11);
	g.p("소사", 11);
	g.p("역곡", 11);
	g.p("온수", 11);
	g.p("오류동", 11);
	g.p("개봉", 11);
	g.p("구일", 11);
	g.insertEdge(56, 36, 11);//구일 구로 연결
	g.change("구로", "신도림", 11);
	g.p("영등포", 11);
	g.p("신길", 11);
	g.p("대방", 11);
	g.p("노량진", 11);
	g.p("용산", 11);
	g.p("남영", 11);
	g.p("서울역", 11);
	g.p("시청", 11);
	g.p("종각", 11);
	g.p("종로3가", 11);
	g.p("종로5가", 11);
	g.p("동대문", 11);
	g.p("동묘앞", 11);
	g.p("신설동", 11);
	g.p("제기동", 11);
	g.p("청량기", 11);
	g.p("회기", 11);
	g.p("외대앞", 11);
	g.p("신이문", 11);
	g.p("석계", 11);
	g.p("광운대", 11);
	g.p("월계", 11);
	g.p("녹천", 11);
	g.p("창동", 11);
	g.p("방학", 11);
	g.p("도봉", 11);
	g.p("도봉산", 11);
	g.p("망월사", 11);
	g.p("회룡", 11);
	g.p("의정부", 11);
	g.p("가능", 11);
	g.p("녹양", 11);
	g.p("양주", 11);
	g.p("덕계", 11);
	g.p("덕정", 11);
	g.p("지행", 11);
	g.p("동두천중앙", 11);
	g.p("보산", 11);
	g.p("동두천", 11);
	g.p("소요산", 11);
	//2호선
	g.insertVertex("사당");
	g.p("낙성대", 12);
	g.p("서울대입구", 12);
	g.p("봉천", 12);
	g.p("신림", 12);
	g.p("신대방", 12);
	g.p("구로디지털단지", 12);
	g.p("대림", 12);
	g.insertEdge(57, 105, 12); // 대림 신도림 연결
	g.change("신도림" ,"문래", 12);
	g.p("영등포구청", 12);
	g.p("당산", 12);
	g.p("합정", 12);
	g.p("홍대입구", 12);
	g.p("신촌", 12);
	g.p("이대", 12);
	g.p("아현", 12);
	g.p("충정로", 12);
	g.insertEdge(65, 114, 12); //충정로 시청 연결
	g.change("시청", "을지로입구", 12);
	g.p("을지로3가", 12);
	g.p("을지로4가", 12);
	g.p("동대문역사문화공원", 12);
	g.p("신당", 12);
	g.p("상왕십리", 12);
	g.p("왕십리", 12);
	g.p("한양대", 12);
	g.p("뚝섬", 12);
	g.p("성수", 12);
	g.p("건대입구", 12);
	g.p("구의", 12);
	g.p("강변", 12);
	g.p("잠실나루", 12);
	g.p("잠실", 12);
	g.p("잠실새내", 12);
	g.p("종합운동장", 12);
	g.p("삼성", 12);
	g.p("선릉", 12);
	g.p("역삼", 12);
	g.p("교대", 12);
	g.p("서초", 12);
	g.p("방배", 12);
	g.insertEdge(98, 137, 12);//방배 사당연결
	g.insertVertex("까치산");
	g.p("신정네거리", 12);
	g.p("양천구청", 12);
	g.p("도림천", 12);
	g.insertEdge(141, 57, 12);//도림천 신도림 연결
	g.insertVertex("신설동");
	g.p("용두", 12);
	g.p("신답", 12);
	g.p("용답", 12);
	g.insertEdge(145, 124, 12);//용답 성수 연결
	//3호선
	g.insertVertex("대화");
	g.p("주엽", 13);
	g.p("정발산", 13);
	g.p("마두", 13);
	g.p("백석", 13);
	g.p("대곡", 13);
	g.p("화정", 13);
	g.p("원당", 13);
	g.p("원흥", 13);
	g.p("삼송", 13);
	g.p("지축", 13);
	g.p("구파발", 13);
	g.p("연신내", 13);
	g.p("불광", 13);
	g.p("녹번", 13);
	g.p("홍제", 13);
	g.p("무악재", 13);
	g.p("독립문", 13);
	g.p("경복궁", 13);
	g.p("안국", 13);
	g.insertEdge(67, 165, 13);//안국 종로3가 연결
	g.insertEdge(67, 116, 13);//종로3가 을지로3가 연결
	g.change("을지로3가", "충무로", 13);
	g.p("동대입구", 13);
	g.p("약수", 13);
	g.p("금호", 13);
	g.p("옥수", 13);
	g.p("압구정", 13);
	g.p("신사", 13);
	g.p("잠원", 13);
	g.p("고속터미널", 13);
	g.insertEdge(135, 174, 13);//고속터미널 교대 연결
	g.change("교대", "남부터미널", 13);
	g.p("양재", 13);
	g.p("매봉", 13);
	g.p("도곡", 13);
	g.p("대치", 13);
	g.p("학여울", 13);
	g.p("대청", 13);
	g.p("일원", 13);
	g.p("수서", 13);
	g.p("가락시장", 13);
	g.p("경찰병원", 13);
	g.p("오금", 13);
	//4호선
	g.insertVertex("오이도");
	g.p("정왕", 14);
	g.p("신길온천", 14);
	g.p("안산", 14);
	g.p("초지", 14);
	g.p("고잔", 14);
	g.p("중앙", 14);
	g.p("한대앞", 14);
	g.p("상록수", 14);
	g.p("반월", 14);
	g.p("대야미", 14);
	g.p("수리산", 14);
	g.p("산본", 14);
	g.insertEdge(27, 200, 14); // 산본 금정 연결
	g.change("금정", "범계", 14);
	g.p("평촌", 14);
	g.p("인덕원", 14);
	g.p("정부과천청사", 14);
	g.p("과천", 14);
	g.p("대공원", 14);
	g.p("경마공원", 14);
	g.p("선바위", 14);
	g.p("남태령", 14);
	g.insertEdge(98, 209, 14); //남태령 사당 연결
	g.change("사당", "이수", 14);
	g.p("동작", 14);
	g.p("이촌", 14);
	g.p("신용산", 14);
	g.p("삼각지", 14);
	g.p("숙대입구", 14);
	g.insertEdge(64, 214, 14); // 숙대입구 서울역 연결
	g.change("서울역", "회현", 14);
	g.p("명동", 14);
	g.insertEdge(216, 166, 14); // 명동 충무로 연결
	g.insertEdge(166, 118, 14); // 충무로 동대문역사문화공원 연결
	g.insertEdge(69, 118, 14); // 동대문역사문화공원 동대문 연결
	g.change("동대문", "혜화", 14);
	g.p("한성대입구", 14);
	g.p("성신여대입구", 14);
	g.p("길음", 14);
	g.p("미아사거리", 14);
	g.p("미아", 14);
	g.p("수유", 14);
	g.p("쌍문", 14);
	g.insertEdge(81, 224, 14); // 쌍문 창동 연결
	g.change("창동", "노원", 14);
	g.p("상계", 14);
	g.p("당고개", 14);
	g.end();
	g.store("graph_Floyd.txt");
	return 0;
}